.doom.d/config.org
# -*- mode: org; coding: utf-8; -*-
#+author: David Spreekmeester @aapit
#+filetags: :software:
* David's Doom Emacs config
:PROPERTIES:
:ID:       emacs-config
:header-args: :tangle "config.el" :results silent
:END:
** initialization
:PROPERTIES:
:VISIBILITY: folded
:END:
 #+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
; Generated config by @aapit
 #+END_SRC
** general
:PROPERTIES:
:VISIBILITY: content
:END:
*** locale
In my geographic area, the week starts on Monday (=1=).
Default is Sunday (=0=).
#+BEGIN_SRC emacs-lisp
(setq calendar-week-start-day 1)
(setq
 display-time-format "%H:%M"
 display-time-24hr-format t)
(setq system-time-locale "nl_NL.utf8")
(setenv "LANG" "nl_NL.utf8")
#+END_SRC
*** secrets
 #+BEGIN_SRC emacs-lisp
(load! "secrets.el" doom-user-dir)
#+END_SRC
*** trash
#+BEGIN_SRC emacs-lisp
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 tab-width 4)                                      ; Set width for tabs
#+END_SRC
*** browser
 #+BEGIN_SRC emacs-lisp
(cond ((eq system-type 'darwin)
    (setq browse-url-browser-function 'browse-url-default-browser))
    (t (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "brave"))
)
#+END_SRC
** UI
:PROPERTIES:
:VISIBILITY: content
:END:
*** fonts
Setting default font and /Symbola/ as emoji fallback.
 #+BEGIN_SRC emacs-lisp
(setenv "LANG" "en_US.UTF-8")

(setq doom-unicode-font (font-spec :name "Symbola"))

(setq doom-font (font-spec :family "Lotion" :size (if (string= (system-name) "tinynozem") 48 36)))
;(setq doom-font (font-spec :family "DaddyTimeMono" :size (if (string= (system-name) "tinynozem") 48 36)))
;(setq doom-font (font-spec :family "FantasqueSansMono Nerd Font Mono" :size (if (string= (system-name) "tinynozem") 48 36)))
 #+END_SRC
*** mouse
[2021-01-27 Wed] Disabled the disablement, perhaps temporarily
 #+BEGIN_EXAMPLE emacs-lisp
(add-hook 'emacs-startup-hook (lambda ()
    (global-disable-mouse-mode)
))
#+END_EXAMPLE
*** appearance
#+begin_src emacs-lisp
(setq doom-theme 'doom-horizon)
(setq display-time-use-mail-icon t)
(setq display-line-numbers-type 'relative)
(setq org-ellipsis "…")
(tool-bar-mode -1)
(menu-bar-mode -1)
(toggle-scroll-bar -1)

; remove window chrome
(unless (eq system-type 'darwin)
    (setq default-frame-alist '((undecorated . t))
))

(add-hook 'emacs-startup-hook (lambda ()
;(toggle-frame-fullscreen)
;(display-battery-mode)
(delete-selection-mode 1) ; replace selection when inserting text
))

; turn on line wrapping for all doc types
(global-visual-line-mode 1)

; hide ellipsis after collapsed nodes
;(setq org-ellipsis "")
;(set-face-attribute 'org-ellipsis nil :foreground (face-attribute 'default :background))
;(add-hook 'org-mode-hook (lambda () (set display-table (make-display-table))))

(after! org
  (setq org-ellipsis ""))
#+end_src
**** hide utf-8 encoding in modeline
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "we expect the encoding to be lf utf-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+end_src
**** popup rules
#+begin_src emacs-lisp
(when (> (display-pixel-width) '1200)
  (set-popup-rule! "*org agenda*" :side 'left :size .40 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "capture-" :side 'left :size .40 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*capture*" :side 'left :size .40 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*messages*" :side 'left :size .30 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*helm*" :side 'left :size .30 :select t :vslot 5 :ttl 3))
(when (<= (display-pixel-width) '1200)
  (set-popup-rule! "*org agenda*" :side 'bottom :size .40 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "capture-" :side 'left :size .40 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*capture*" :side 'bottom :size .30 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*messages*" :side 'left :size .30 :select t :vslot 2 :ttl 3)
  (set-popup-rule! "*helm*" :side 'bottom :size .30 :select t :vslot 5 :ttl 3))
#+end_src
**** org-related
 #+begin_src emacs-lisp :tangle "config.el" :results silent
(setq org-agenda-span 'week)

;; hide /emphasis markers for italics/ in org-mode
(setq org-hide-emphasis-markers t)

; disabling for performance, for now
;(setq org-startup-with-inline-images t)

(setq-default org-download-image-dir "~/Nextcloud/org-mode/pics")

;; follow output
(setq compilation-scroll-output t)
#+end_src
**** disabled
***** emojify
#+begin_example emacs-lisp
(add-hook 'after-init-hook #'global-emojify-mode)
#+end_example
***** org-roam links
#+begin_example emacs-lisp
;; unfortunately, at this point [2020-07-08 wed],
;; there is no way to style regular non-link text in the org-roam buffer.
;; therefore, the only customizable property that blends in with the rest is link color.
(custom-set-faces
 '(org-roam-link ((t (:foreground "#a4581e"))))
 '(org-roam-link-current ((t (:foreground "#696070"))))
)
#+end_example

***** org-mode checkboxes
#+begin_example emacs-lisp
;; org-mode checkboxes
(add-hook 'evil-org-mode-hook (lambda ()
   "beautify org checkbox symbol"
   (push '("[ ]" . "☐") prettify-symbols-alist)
   (push '("[x]" . "☑" ) prettify-symbols-alist)
   (push '("[-]" . "⊡" ) prettify-symbols-alist)
   (prettify-symbols-mode)))
 #+end_example
*** keys
**** general functions
 #+BEGIN_SRC emacs-lisp
;; Open
(map! :leader
    :prefix "o"
    :desc "Shell" "z" #'shell
    :desc "Term" "t" #'term
)

;; Quick window split shortcuts
(map! :leader
    :prefix "w"
    :desc "Split Hori" "-" #'evil-window-split
    :desc "Split Vert" "\\" #'evil-window-vsplit
)
#+END_SRC
**** window navigation
 #+begin_src emacs-lisp
(cond ((eq system-type 'darwin)
    (setq prefix-by-os "§"))
    (t (setq prefix-by-os "`"))
)
(map!
   :prefix prefix-by-os
   :n "h" #'evil-window-left
   :n "l" #'evil-window-right
   :n "k" #'evil-window-up
   :n "j" #'evil-window-down
   :n "-" #'evil-window-split
   :n "\\" #'evil-window-vsplit
   :n prefix-by-os #'other-window
   :n "c" '(lambda () (interactive)(+workspace/new))
   :n "x" '(lambda () (interactive)(+workspace/delete (+workspace-current-name)))
   :n "m-x" #'evil-window-delete
)
#+end_src
**** Org-mode related
 #+BEGIN_SRC emacs-lisp
(map! :after evil-org
    :map evil-org-mode-map
    :n "M-j" #'org-metadown
    :n "M-k" #'org-metaup
)
;; Export
(map! :after evil-org
    :map org-mode-map
    :leader
    :prefix ("e" . "export")
    :desc "html export (buffer)" "h" #'org-html-export-to-html
    :desc "various (region to pdf, etc)" "v" #'org-export-dispatch
    :desc "pdf (buffer)" "p" #'org-latex-export-to-pdf
)
;; Agenda
(map!
    :leader
    :desc "Agenda" "a" #'org-agenda
)
#+END_SRC
**** Org-roam related
 #+BEGIN_SRC emacs-lisp
;; Insert
(map! :after org-roam
        :map org-roam-mode-map
        :leader
        :prefix "i"
        :desc "Timestamp" "T" #'org-time-stamp
        :desc "Timestamp inactive" "t" #'org-time-stamp-inactive
)
;; Notes
(map! :after org-roam
        :map org-mode-map
        :leader
        :desc "Find, Insert note" "v" #'org-roam-node-find
)
(map! :after org-roam
        :map org-mode-map
        :leader
        :prefix "n"
        :desc "Graph server" "g" #'org-roam-server-mode
)
#+END_SRC
** capture templates
*** Org Ref templates
 #+BEGIN_SRC emacs-lisp
(setq org-roam-ref-capture-templates
    '(("r" "ref" plain (function org-roam-capture--get-point)
        "%?"
        :file-name "websites/${slug}"
        :head "#+TITLE: ${title}
,#+ROAM_KEY: ${ref}
- source :: ${ref}"
        :unnarrowed t)))
#+END_SRC
