.doom.d/config.org
**** use only tagged files as todo files
=org-agenda-files= sets the source dir for the todo list.
#+begin_quote
Which files do I want to be checked for entries when compiling my agenda?
#+end_quote
[[https://orgmode.org/worg/org-configs/org-customization-guide.html][Org customization guide]]
#+BEGIN_SRC emacs-lisp
(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  (seq-uniq (mapcar #'org-roam-node-file
          (seq-filter
           (my/org-roam-filter-by-tag tag-name)
           (org-roam-node-list)))))

(defun my/org-roam-refresh-agenda-list ()
  (interactive)
  (setq org-agenda-files (my/org-roam-list-notes-by-tag "project")))

;; Build the agenda list the first time for the session
(after! org-roam
    (my/org-roam-refresh-agenda-list))
#+END_SRC
*** agenda
**** custom agenda views
 #+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
    '(
        ("p" "Privé" agenda "Persoonlijk"
         ((org-agenda-files '("~/Notes/todo.org"))))
    )
)
#+END_SRC
**** agenda groups
#+BEGIN_SRC emacs-lisp
;(let ((org-super-agenda-groups
;       '((:auto-category t))))
;  (org-agenda-list))

(setq org-super-agenda-groups
      '((:name "Next Items"
               :time-grid t
               :tag ("NEXT" "outbox"))
        (:name "Important"
               :priority "A")
        (:name "Quick Picks"
               :effort< "0:30")
        (:priority<= "B"
                     :scheduled future
                     :order 1)))
#+END_SRC
*** export
Setting some non-insane defaults for LaTeX PDF export and such.

**** Links
 #+BEGIN_SRC emacs-lisp
(after! org
    (add-to-list 'org-latex-packages-alist "\\hypersetup{setpagesize=false}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{colorlinks=true}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{linkcolor=blue}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{draft}" t)
)
#+END_SRC
For now, I set all LaTeX links to /draft/, to hide them in exports.

***** NEXT [#C] Show only urls in LaTeX export
Ideally, I only want to export urls, but ignore the internal Org-roam links in exporting.

Perhaps achievable with one of these options:
#+begin_example latex
hidelinks
\hyper@link
\hyper@linkfile
\hyper@linkurl
#+end_example
**** Font
 #+BEGIN_SRC emacs-lisp
(after! org
    (add-to-list 'org-latex-packages-alist "\\usepackage{lmodern}" t)
)
#+END_SRC
***** TODO Fix LaTeX font export
Setting above doesn't seem to work yet.
Suspecting this method only works per document.
https://github.com/xgarrido/org-resume should provide enough working examples.
**** Paragraph
 #+BEGIN_SRC emacs-lisp
(after! org
    (add-to-list 'org-latex-packages-alist "\\setlength\\parindent{0pt}" t)
)
#+END_SRC
**** Sources
- More options in this [[https://www.tug.org/applications/hyperref/manual.html#x1-90003.5][LaTeX hyperref manual]].
- [[https://www.overleaf.com/learn/latex/Font_sizes,_families,_and_styles][Very clear guide]] by Overleaf
- Some settings are inspired by:
  [[http://clothoid.html.xdomain.jp/2018/org-latex-pdf-with-minted-python.html][Clothoid's org-latex-pdf user config]]
*** GUI
Customizing the appearance of bullets and priorities.
#+BEGIN_SRC emacs-lisp
(after! org
  (add-hook! 'org-mode-hook (lambda ()
                              (org-superstar-mode 1)
                              (org-fancy-priorities-mode 1)
                              ))
  )

(use-package! org-superstar
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("☯" "⚛" "◉" "✸" "✿" "✤" "✜" "○")
  ;(setq org-superstar-headline-bullets-list '("⚛" "◉" "○" "✸" "✿" "✤" "✜" "◆")
        org-superstar-prettify-item-bullets t))
#+END_SRC
*** performance
 #+BEGIN_SRC emacs-lisp
(after! org
    (setq org-agenda-dim-blocked-tasks nil)
    (setq org-agenda-inhibit-startup nil)
    (setq org-agenda-use-tag-inheritance nil)
    (setq org-agenda-ignore-properties '(visibility category))
    (setq org-agenda-sticky t)
)
#+END_SRC
*** tags
#+BEGIN_SRC emacs-lisp
;(after! org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
;)
(after! evil-org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)
(after! org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)
(after! org-roam
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)
#+END_SRC
*** todo
**** todo settings
 #+BEGIN_SRC emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)" "PROJ" "IDEA(i)" "HOLD" "ISSUE" "ERROR" "FIX" "WORKAROUND" "QUESTION" "ANSWER")))
  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "maroon1" :weight bold)
                ("NEXT" :foreground "light sea green")
                ("DONE" :foreground "#888888")
                ("PROJ" :foreground "purple1" :weight bold)
                ("IDEA" :foreground "purple1")
                ("HOLD" :foreground "purple1")
                ("ISSUE" :foreground "red" :weight bold)
                ("ERROR" :foreground "red" :weight bold)
                ("FIX" :foreground "green")
                ("WORKAROUND" :foreground "green")
                ("QUESTION" :foreground "maroon1")
                ("ANSWER" :foreground "light sea green")
                )))
  (setq-default org-export-with-todo-keywords nil)
  (setq-default org-enforce-todo-dependencies t)
  )

(use-package! org-fancy-priorities
  :defer t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("⚡" "▶" "⏳")))
#+END_SRC
** Org-roam
:PROPERTIES:
:VISIBILITY: content
:END:
*** general
 #+BEGIN_SRC emacs-lisp
; This can't be a symlink or Org-roam will get confused
(setq org-roam-directory "~/Nextcloud/org-mode/notes/")
; Specifically specified for performance
(setq org-roam-database-connector 'sqlite-builtin)
;(setq org-roam-db-location "~/Nextcloud/org-mode/org-roam.db")
#+END_SRC
*** garbage collector
#+begin_src emacs-lisp
; For performance reasons, delay garbage collection
(use-package! gcmh
  :config
  (setq gcmh-high-read-threshold (* 100 1024 1024) ;; 100MB
        gcmh-idle-delay 10)) ;; Ruim pas op na 10 seconden inactiviteit
#+end_src
*** search
Display template voor node search.
In eerste instantie werd de note titel ingekort tot te weinig karakters.
 #+BEGIN_SRC emacs-lisp
(after! org-roam
    (setq org-roam-node-display-template
        (concat (propertize "${doom-tags:30}" 'face 'org-tag) " ${doom-hierarchy:120}"))
)
#+END_SRC
[2023-01-12 Thu]
Jethro laat ook custom attributen zien bij de resultaten:
https://jethrokuan.github.io/org-roam-guide/
*** graph
#+BEGIN_SRC emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

#+END_SRC
** PHP
:PROPERTIES:
:VISIBILITY: folded
:END:
 #+BEGIN_SRC emacs-lisp
(setq lsp-phpactor-path "phpactor")
;; php
;(use-package! phpactor
;  :mode "\\.php\\'"
;  :defer t
;)
;(use-package! company-phpactor
;  :mode "\\.php\\'"
;  :defer t
;)
;;(composer-setup-managed-phar)
;;(phpactor-install-or-update)

; niet meer nodig ivm moderne lsp setup:
;(use-package! php-mode
;  :mode "\\.php\\'"
;  :defer t
;  :hook ((php-mode . (lambda () (set (make-local-variable 'company-backends)
;       '(;; list of backends
;         company-phpactor
;         company-files
;         ))))))
#+END_SRC
** 3D
 #+BEGIN_SRC emacs-lisp
(use-package! gcode-mode
  :mode "\\.gcode\\'"
  :defer t
)
#+END_SRC
** Projectile
:PROPERTIES:
:VISIBILITY: folded
:END:
 #+BEGIN_SRC emacs-lisp
(setq projectile-project-search-path '("~/Scripts/" "~/Sites/" "~/Remotes" "~/Lab"))
#+END_SRC
** CoPilot
 #+BEGIN_SRC emacs-lisp
;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))
#+END_SRC
