.doom.d/config.el

(defun my/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun my/org-roam-list-notes-by-tag (tag-name)
  (seq-uniq (mapcar #'org-roam-node-file
          (seq-filter
           (my/org-roam-filter-by-tag tag-name)
           (org-roam-node-list)))))

(defun my/org-roam-refresh-agenda-list ()
  (interactive)
  (setq org-agenda-files (my/org-roam-list-notes-by-tag "project")))

;; Build the agenda list the first time for the session
(after! org-roam
    (my/org-roam-refresh-agenda-list))

(setq org-agenda-custom-commands
    '(
        ("p" "Privé" agenda "Persoonlijk"
         ((org-agenda-files '("~/Notes/todo.org"))))
    )
)

;(let ((org-super-agenda-groups
;       '((:auto-category t))))
;  (org-agenda-list))

(setq org-super-agenda-groups
      '((:name "Next Items"
               :time-grid t
               :tag ("NEXT" "outbox"))
        (:name "Important"
               :priority "A")
        (:name "Quick Picks"
               :effort< "0:30")
        (:priority<= "B"
                     :scheduled future
                     :order 1)))

(after! org
    (add-to-list 'org-latex-packages-alist "\\hypersetup{setpagesize=false}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{colorlinks=true}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{linkcolor=blue}" t)
    (add-to-list 'org-latex-packages-alist "\\hypersetup{draft}" t)
)

(after! org
    (add-to-list 'org-latex-packages-alist "\\usepackage{lmodern}" t)
)

(after! org
    (add-to-list 'org-latex-packages-alist "\\setlength\\parindent{0pt}" t)
)

(after! org
  (add-hook! 'org-mode-hook (lambda ()
                              (org-superstar-mode 1)
                              (org-fancy-priorities-mode 1)
                              ))
  )

(use-package! org-superstar
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("☯" "⚛" "◉" "✸" "✿" "✤" "✜" "○")
  ;(setq org-superstar-headline-bullets-list '("⚛" "◉" "○" "✸" "✿" "✤" "✜" "◆")
        org-superstar-prettify-item-bullets t))

(after! org
    (setq org-agenda-dim-blocked-tasks nil)
    (setq org-agenda-inhibit-startup nil)
    (setq org-agenda-use-tag-inheritance nil)
    (setq org-agenda-ignore-properties '(visibility category))
    (setq org-agenda-sticky t)
)

;(after! org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
;)
(after! evil-org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)
(after! org
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)
(after! org-roam
    (setq org-use-tag-inheritance nil)
    (setq org-tags-exclude-from-inheritance '("crypt" "index"))
)

(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)" "PROJ" "IDEA(i)" "HOLD" "ISSUE" "ERROR" "FIX" "WORKAROUND" "QUESTION" "ANSWER")))
  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "maroon1" :weight bold)
                ("NEXT" :foreground "light sea green")
                ("DONE" :foreground "#888888")
                ("PROJ" :foreground "purple1" :weight bold)
                ("IDEA" :foreground "purple1")
                ("HOLD" :foreground "purple1")
                ("ISSUE" :foreground "red" :weight bold)
                ("ERROR" :foreground "red" :weight bold)
                ("FIX" :foreground "green")
                ("WORKAROUND" :foreground "green")
                ("QUESTION" :foreground "maroon1")
                ("ANSWER" :foreground "light sea green")
                )))
  (setq-default org-export-with-todo-keywords nil)
  (setq-default org-enforce-todo-dependencies t)
  )

(use-package! org-fancy-priorities
  :defer t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("⚡" "▶" "⏳")))

; This can't be a symlink or Org-roam will get confused
(setq org-roam-directory "~/Nextcloud/org-mode/notes/")
; Specifically specified for performance
(setq org-roam-database-connector 'sqlite-builtin)
;(setq org-roam-db-location "~/Nextcloud/org-mode/org-roam.db")

; For performance reasons, delay garbage collection
(use-package! gcmh
  :config
  (setq gcmh-high-read-threshold (* 100 1024 1024) ;; 100MB
        gcmh-idle-delay 10)) ;; Ruim pas op na 10 seconden inactiviteit

(after! org-roam
    (setq org-roam-node-display-template
        (concat (propertize "${doom-tags:30}" 'face 'org-tag) " ${doom-hierarchy:120}"))
)

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(setq lsp-phpactor-path "phpactor")
;; php
;(use-package! phpactor
;  :mode "\\.php\\'"
;  :defer t
;)
;(use-package! company-phpactor
;  :mode "\\.php\\'"
;  :defer t
;)
;;(composer-setup-managed-phar)
;;(phpactor-install-or-update)

; niet meer nodig ivm moderne lsp setup:
;(use-package! php-mode
;  :mode "\\.php\\'"
;  :defer t
;  :hook ((php-mode . (lambda () (set (make-local-variable 'company-backends)
;       '(;; list of backends
;         company-phpactor
;         company-files
;         ))))))

(use-package! gcode-mode
  :mode "\\.gcode\\'"
  :defer t
)

(setq projectile-project-search-path '("~/Scripts/" "~/Sites/" "~/Remotes" "~/Lab"))

;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))
