.doom.d/config.el

(setq lsp-dart-sdk-path "/opt/homebrew/Caskroom/flutter/3.38.5/flutter/bin/cache/dart-sdk/")
(setq flutter-sdk-path "/opt/homebrew/Caskroom/flutter/3.38.5/flutter")

(defun my/start-android-emulator ()
  "Ask for an Android emulator and fire it up on the background."
  (interactive)
  (let ((avds (split-string (shell-command-to-string "emulator -list-avds") "\n" t)))
    (if avds
        (let ((chosen-avd (completing-read "Choose emulator: " avds)))
          (start-process "android-emulator" nil "emulator" "-avd" chosen-avd)
          (message "Android emulator '%s' is starting..." chosen-avd))
      (user-error "No Android emulators found."))))

;; Koppel het aan een logische shortcut, bijv. SPC m e (Android Emulator)
(map! :leader
      :desc "Start Android Emulator" "m e" #'my/start-android-emulator)

(use-package! add-node-modules-path
  :hook ((js2-mode . add-node-modules-path)
         (typescript-mode . add-node-modules-path)))

(apheleia-global-mode +1) ;; Formats automatically through Prettier on save
